Repository: yagizzha/GRBL-Plotter-Tests-----svenhb
Catalog: GRBL-Plotter/MachineControl/ControlSerialForm.*.resx
Languages: cs

# cbPort.ToolTip
source: Select free serial port
cs: Vyberte volný sériový port

# cbBaud.ToolTip
source: Select speed
cs: Vyberte rychlost

# btnScanPort.Text
source: Scan Ports
cs: Skenování portů

# btnScanPort.ToolTip
source: Scan for free ports
cs: Vyhledejte volné porty

# pasteCodeFromClipboardToolStripMenuItem.Text
source: Paste Code from clipboard
cs: Vložte kód ze schránky

# copySelectionToClipboardToolStripMenuItem.Text
source: Copy selection to clipboard
cs: Zkopírujte výběr do schránky

# selectAllToolStripMenuItem.Text
source: Select all
cs: Vybrat vše

# btnClear.Text
source: Clear Log
cs: Vymazat protokol

# btnClear.ToolTip
source: Clear list above
cs: Přehledný seznam výše

# btnSend.Text
source: Send
cs: Poslat

# btnSend.ToolTip
source: Press to send command
cs: Stisknutím odešlete příkaz

# btnGRBLCommand0.ToolTip
source: Help: Get list of all GRBL commands
cs: Nápověda: Získejte seznam všech příkazů GRBL

# btnGRBLCommand1.ToolTip
source: View Grbl settings
cs: Zobrazit nastavení Grbl

# btnGRBLCommand2.ToolTip
source: View g-code parameters
cs: Zobrazit parametry g-kódu

# btnGRBLCommand3.ToolTip
source: View startup blocks
cs: Zobrazit spouštěcí bloky

# btnGRBLCommand4.ToolTip
source: Kill alarm lock
cs: Zabijte zámek alarmu

# lblSrPos.ToolTip
source: Work Position
cs: Pracovní pozice

# label2.ToolTip
source: Buffer State (needs to be enabled via $10=2)
cs: Stav vyrovnávací paměti (je třeba povolit prostřednictvím $10=2)

# lblSrBf.ToolTip
source: Buffer State (needs to be enabled via $10=2)
cs: Stav vyrovnávací paměti (je třeba povolit prostřednictvím $10=2)

# label4.ToolTip
source: Current Feed (mm/min) and Speed (RPM)
cs: Aktuální posuv (mm/min) a rychlost (RPM)

# lblSrFS.ToolTip
source: Current Feed (mm/min) and Speed (RPM)
cs: Aktuální posuv (mm/min) a rychlost (RPM)

# lblSrPn.ToolTip
source: Input Pin State for XYZ, Probe, Door, Hold, soft-Reset, cycle-Start
cs: Stav vstupního kolíku pro XYZ, sonda, dveře, přidržení, měkký reset, spuštění cyklu

# label7.ToolTip
source: Input Pin State for XYZ, Probe, Door, Hold, soft-Reset, cycle-Start
cs: Stav vstupního kolíku pro XYZ, sonda, dveře, přidržení, měkký reset, spuštění cyklu

# lblSrOv.ToolTip
source: Override Values for feed, rapids and speed in %
cs: Přepsat hodnoty pro posuv, rychlost a rychlost v %

# label9.ToolTip
source: Override Values for feed, rapids and speed in %
cs: Přepsat hodnoty pro posuv, rychlost a rychlost v %

# lblSrA.ToolTip
source: Accessory State S=spindle CW, C=spindle CCW, F=floot colant, M=mist coolant
cs: Stav příslušenství S=vřeteno CW, C=vřeteno CCW, F=spodní kapalina, M=mlha chladicí kapalina

# LblAccessoryState.ToolTip
source: Accessory State S=spindle CW, C=spindle CCW, F=floot colant, M=mist coolant
cs: Stav příslušenství S=vřeteno CW, C=vřeteno CCW, F=spodní kapalina, M=mlha chladicí kapalina

# lblSrLn.ToolTip
source: Line Number (needs to be enabled in config.h)
cs: Číslo řádku (musí být povoleno v config.h)

# label13.ToolTip
source: Line Number (needs to be enabled in config.h)
cs: Číslo řádku (musí být povoleno v config.h)

# btnCheckGRBL.Text
source: Check GRBL
cs: Zkontrolujte GRBL

# btnCheckGRBL.ToolTip
source: Check GRBL setup for maximum and minimum limits Not for GRBL Vers. < 1.0
cs: Zkontrolujte nastavení GRBL pro maximální a minimální limity Ne pro GRBL Vers. < 1,0

# btnGRBLReset.ToolTip
source: Soft Reset via CTRL-X
cs: Soft Reset pomocí CTRL-X

# btnGRBLHardReset.ToolTip
source: Try hard Reset via DTR / RTS Success depends on used hardware (DTR, RTS wired?)
cs: Zkuste tvrdý reset přes DTR / RTS Úspěch závisí na použitém hardwaru (DTR, RTS drátové?)

# btnGRBLCmndParser.ToolTip
source: View g-code parser state
cs: Zobrazit stav analyzátoru kódu g

# btnGRBLCmndBuild.ToolTip
source: View build info
cs: Zobrazit informace o sestavení

# cBStatus.Text
source: Show Real-time Status Report
cs: Zobrazit zprávu o stavu v reálném čase

# cBStatus.ToolTip
source: Show the original received GRBL status reports
cs: Zobrazit původní přijaté zprávy o stavu GRBL

# cBStatus1.ToolTip
source: Show sent and processed commands during streaming
cs: Zobrazit odeslané a zpracované příkazy během streamování

# lblSrState.Text
source: Status
cs: Postavení

# groupBox1.Text
source: Real-time Status Report
cs: Zpráva o stavu v reálném čase
