Repository: yagizzha/GRBL-Plotter-Tests-----svenhb
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeFromShape.*.resx
Languages: de_de

# cBToolSet.Text
source: Get values from tool table
de_de: Übernehme Werte aus Werkzeugliste

# nUDToolOverlap.ToolTip
source: Distance between two paths (when doing a pocket) as tool diameter. 100% = tool diameter step width.
de_de: Abstand der Pfade in % (des Werkzeugdurchmessers) wenn Taschen gefräst werden

# label16.Text
source: Overlap %
de_de: Überlappung

# label16.ToolTip
source: Distance between two paths (when doing a pocket) as tool diameter. 100% = tool diameter step width.
de_de: Abstand der Pfade in % (des Werkzeugdurchmessers) wenn Taschen gefräst werden

# nUDToolFeedZ.ToolTip
source: Feed rate for Z
de_de: Fahrgeschwindigkeit auf der Z Achse

# nUDToolFeedXY.ToolTip
source: Feed rate for XY direction
de_de: Fahrgeschwindigkeit auf der XY Achse

# nUDToolZStep.ToolTip
source: Depth per pass (not final depth)
de_de: Maximale Tiefenzustellung der Z-Achse pro Durchgang (nicht endgültige Tiefe)

# nUDToolDiameter.ToolTip
source: Tool diameter to calculate offset path offset
de_de: Werkzeugdurchmesser (Fräser, Laser, Stift) um Pfad-Offset berechnen zu können

# label3.Text
source: Diameter
de_de: Durchmesser

# groupBox1.Text
source: Tool
de_de: Werkzeug

# label19.Text
source: Y-Dimension
de_de: Höhe (Y)

# label18.Text
source: X-Dimension
de_de: Breite (X)

# rBShape2.Text
source: Rectangle round edge
de_de: Rechteck, runde Ecken

# rBShape1.Text
source: Rectangle
de_de: Rechteck

# rBShape3.Text
source: Circle
de_de: Kreis

# groupBox2.Text
source: Shape
de_de: Form

# nUDImportGCZDown.ToolTip
source: Final deepth of the shape
de_de: Endgültige Tiefe der Form

# label20.Text
source: Depth (Z)
de_de: Tiefe (Z)

# rBToolpath2.Text
source: Outside the shape
de_de: Ausserhalb der Kontur

# rBToolpath3.Text
source: Inside the shape
de_de: Innerhalb der Kontur

# rBToolpath1.Text
source: On the shape (engraving)
de_de: Auf der Kontur (Gravieren)

# groupBox3.Text
source: Toolpath
de_de: Werkzeugpfad

# groupBox4.Text
source: Dimensions
de_de: Maße

# cBToolpathPocket.Text
source: Create Pocket
de_de: Tasche erzeugen

# btnApply.Text
source: Create G-Code
de_de: Erzeuge G-Code

# groupBox5.Text
source: Origin
de_de: Nullpunkt

# tabPage1.Text
source: Rectangle / Circle
de_de: Rechteck / Kreis

# rBBevel1.Text
source: Round off
de_de: Abrunden

# rBBevel2.Text
source: Bevel
de_de: Fase

# label2.Text
source: Radius / Distance
de_de: Radius / Abstand

# groupBox6.Text
source: Edge shape
de_de: Kantenform

# tabPage2.Text
source: Bevel / Round off
de_de: Abschrägen / Abrunden

# groupBox7.Text
source: Depth
de_de: Tiefe

# $this.Text
source: Create G-Code from Shapes
de_de: Erzeuge G-Code aus Formen

# label6.Text
source: Deviation
de_de: Abweichung

# label5.Text
source: Width
de_de: Breite

# rBRoundZXL.Text
source: Radius on Z-X-left, width on Y
de_de: Radius auf Z-X-links, Breite auf Y.

# rBRoundZYB.Text
source: Radius on Z-Y-bottom, width on X
de_de: Radius auf Z-Y-unten, Breite auf X.

# rBRoundZXR.Text
source: Radius on Z-X-right, width on Y
de_de: Radius auf Z-X-rechts, Breite auf Y.

# rBRoundZYT.Text
source: Radius on Z-Y-top, width on X
de_de: Radius auf Z-Y-oben, Breite auf X.

# tabPage3.Text
source: Round off Z
de_de: Abrundung Richtung Z

# cBMoveTo00.Text
source: Finally move to 0;0
de_de: Abschließend zu 0; 0 fahren

# nUDRZRadius.ToolTip
source: Radius in Z direction
de_de: Radius in Z-Richtung

# nUDRZWidth.ToolTip
source: Width of the round off
de_de: Breite der Runde

# nUDRZStep.ToolTip
source: Max. allowed deviation to a 1/4 circle in units
de_de: Max. erlaubte Abweichung zu einem 1/4 Kreis in Einheiten

# label7.Text
source: Path calculation for cylindrical milling cutter
de_de: Bahnberechnung für zylindrischen Fräser

# groupBox8.Text
source: Round off position
de_de: Position zum Abrunden

# cBNoZUp.Text
source: Avoid Z-up
de_de: Z-up vermeiden

# label1.Text
source: Tool:
de_de: Werkzeug:

# CbInsertCode.Text
source: Insert shape into 2D-view (at position 0;0)
de_de: Form in 2D-Ansicht einfügen (an Position 0;0)
